bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/TINY/ATTINY102.xml
<?xml version="1.0" encoding="UTF-8"?>
<target-description-file schema-version="4.1">
    <variants>
        <variant ordercode="ATtiny102-M7R " package="UDFN8" pinout="SOIC_8" speedmax="12000000" tempmax="105"
                 tempmin="-40" vccmax="5.5" vccmin="1.8"/>
        <variant ordercode="ATtiny102F-M7R" package="UDFN8" pinout="SOIC_8" speedmax="12000000" tempmax="105"
                 tempmin="-40" vccmax="5.5" vccmin="1.8"/>
        <variant ordercode="ATtiny102-SSNR " package="SOIC8" pinout="SOIC_8" speedmax="12000000" tempmax="105"
                 tempmin="-40" vccmax="5.5" vccmin="1.8"/>
        <variant ordercode="ATtiny102F-SSNR" package="SOIC8" pinout="SOIC_8" speedmax="12000000" tempmax="105"
                 tempmin="-40" vccmax="5.5" vccmin="1.8"/>
        <variant ordercode="ATtiny102-M8R " package="UDFN8" pinout="SOIC_8" speedmax="12000000" tempmax="125"
                 tempmin="-40" vccmax="5.5" vccmin="1.8"/>
        <variant ordercode="ATtiny102F-M8R" package="UDFN8" pinout="SOIC_8" speedmax="12000000" tempmax="125"
                 tempmin="-40" vccmax="5.5" vccmin="1.8"/>
        <variant ordercode="ATtiny102-SSFR " package="SOIC8" pinout="SOIC_8" speedmax="12000000" tempmax="125"
                 tempmin="-40" vccmax="5.5" vccmin="1.8"/>
        <variant ordercode="ATtiny102F-SSFR" package="SOIC8" pinout="SOIC_8" speedmax="12000000" tempmax="125"
                 tempmin="-40" vccmax="5.5" vccmin="1.8"/>
    </variants>
    <device name="ATtiny102" architecture="AVR8L" family="tinyAVR">
        <address-spaces>
            <address-space endianness="little" name="prog" id="prog" start="0x0000" size="0x0400">
                <memory-segment start="0x0000" size="0x0400" type="flash" rw="RW" exec="1" name="FLASH"
                                pagesize="0x80"/>
            </address-space>
            <address-space endianness="little" name="signatures" id="signatures" start="0" size="3">
                <memory-segment start="0" size="3" type="signatures" rw="R" exec="0" name="SIGNATURES"/>
            </address-space>
            <address-space endianness="little" name="fuses" id="fuses" start="0" size="0x0001">
                <memory-segment start="0" size="0x0001" type="fuses" rw="RW" exec="0" name="FUSES"/>
            </address-space>
            <address-space endianness="little" name="lockbits" id="lockbits" start="0" size="0x0001">
                <memory-segment start="0" size="0x0001" type="lockbits" rw="RW" exec="0" name="LOCKBITS"/>
            </address-space>
            <address-space size="0x4400" start="0x0000" endianness="little" name="data" id="data">
                <memory-segment type="io" size="0x40" start="0x0000" name="IO"/>
                <memory-segment type="ram" size="0x20" start="0x0040" name="SRAM"/>
                <memory-segment type="sysreg" size="0x0002" start="0x3F00" name="MAPPED_NVM_LOCK_BITS"/>
                <memory-segment type="sysreg" size="0x0002" start="0x3F40" name="MAPPED_CONFIGURATION_BITS"/>
                <memory-segment type="sysreg" size="0x0002" start="0x3F80" name="MAPPED_CALIBRATION_BITS"/>
                <memory-segment type="sysreg" size="0x0004" start="0x3FC0" name="MAPPED_DEVICE_ID_BITS"/>
                <memory-segment type="other" start="0x4000" name="MAPPED_FLASH" size="0x0400"/>
            </address-space>
        </address-spaces>
        <peripherals>
            <module name="ADC">
                <instance name="ADC" caption="Analog-to-Digital Converter">
                    <register-group name="ADC" name-in-module="ADC" offset="0x00" address-space="data"
                                    caption="Analog-to-Digital Converter"/>
                    <signals>
                        <signal function="ADC" group="ADC" index="0" pad="PA0"/>
                        <signal function="ADC" group="ADC" index="1" pad="PA1"/>
                        <signal function="ADC" group="ADC" index="5" pad="PB1"/>
                        <signal function="ADC" group="ADC" index="6" pad="PB2"/>
                        <signal function="ADC" group="ADC" index="7" pad="PB3"/>
                    </signals>
                </instance>
            </module>
            <module name="AC">
                <instance name="AC" caption="Analog Comparator">
                    <register-group name="AC" name-in-module="AC" offset="0x00" address-space="data"
                                    caption="Analog Comparator"/>
                    <signals>
                        <signal function="ACIN" group="AIN" index="0" pad="PA0"/>
                        <signal function="ACIN" group="AIN" index="1" pad="PA1"/>
                        <signal function="ACOUT" group="ACO" pad="PB3"/>
                    </signals>
                </instance>
            </module>
            <module name="CPU">
                <instance name="CPU" caption="CPU Registers">
                    <register-group name="CPU" name-in-module="CPU" offset="0x00" address-space="data"
                                    caption="CPU Registers"/>
                    <parameters>
                        <param name="CORE_VERSION" value="AVR8L_0"/>
                    </parameters>
                </instance>
            </module>
            <module name="PORT">
                <instance name="PORTA" caption="I/O Port">
                    <register-group name="PORTA" name-in-module="PORTA" offset="0x00" address-space="data"
                                    caption="I/O Port"/>
                    <signals>
                        <signal function="PORTA" group="P" index="0" pad="PA0"/>
                        <signal function="PORTA" group="P" index="1" pad="PA1"/>
                        <signal function="PORTA" group="P" index="2" pad="PA2"/>
                    </signals>
                </instance>
                <instance name="PORTB" caption="I/O Port">
                    <register-group name="PORTB" name-in-module="PORTB" offset="0x00" address-space="data"
                                    caption="I/O Port"/>
                    <signals>
                        <signal function="PORTB" group="P" index="1" pad="PB1"/>
                        <signal function="PORTB" group="P" index="2" pad="PB2"/>
                        <signal function="PORTB" group="P" index="3" pad="PB3"/>
                    </signals>
                </instance>
            </module>
            <module name="EXINT">
                <instance name="EXINT" caption="External Interrupts">
                    <register-group name="EXINT" name-in-module="EXINT" offset="0x00" address-space="data"
                                    caption="External Interrupts"/>
                    <signals>
                        <signal function="EXTINT" group="PCINT" index="0" pad="PA0"/>
                        <signal function="EXTINT" group="PCINT" index="1" pad="PA1"/>
                        <signal function="EXTINT" group="PCINT" index="2" pad="PA2"/>
                        <signal function="EXTINT" group="PCINT" index="9" pad="PB1"/>
                        <signal function="EXTINT" group="PCINT" index="10" pad="PB2"/>
                        <signal function="EXTINT" group="PCINT" index="11" pad="PB3"/>
                        <signal function="EXTINT" group="INT" index="0" pad="PB1"/>
                    </signals>
                </instance>
            </module>
            <module name="TC16">
                <instance name="TC0" caption="Timer/Counter, 16-bit">
                    <register-group name="TC0" name-in-module="TC0" offset="0x00" address-space="data"
                                    caption="Timer/Counter, 16-bit"/>
                    <signals>
                        <signal function="DEF" group="ICP0" pad="PB2"/>
                        <signal function="DEF" group="OC0A" pad="PB1"/>
                        <signal function="DEF" group="OC0B" pad="PA1"/>
                        <signal function="DEF" group="T0" pad="PA0"/>
                    </signals>
                </instance>
            </module>
            <module name="WDT">
                <instance name="WDT" caption="Watchdog Timer">
                    <register-group name="WDT" name-in-module="WDT" offset="0x00" address-space="data"
                                    caption="Watchdog Timer"/>
                </instance>
            </module>
            <module name="FUSE">
                <instance name="FUSE" caption="Fuses">
                    <register-group name="FUSE" name-in-module="FUSE" offset="0" address-space="fuses" caption="Fuses"/>
